#### OpenTofu Format and Style 🖌`success`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`failure`

<details><summary>Show Plan</summary>

```

tofu
Acquiring state lock. This may take a few moments...
module.sebastian-toepfer.sonarcloud_project.projects["pdfbox-fluent-layout"]: Refreshing state... [id=sebastian-toepfer_pdfbox-fluent-layout]
module.sebastian-toepfer.sonarcloud_project.projects["domain-driven-desgin"]: Refreshing state... [id=sebastian-toepfer_domain-driven-desgin]
module.sebastian-toepfer.sonarcloud_project.projects["json-printable-maven-plugin"]: Refreshing state... [id=sebastian-toepfer_json-printable-maven-plugin]
module.sebastian-toepfer.sonarcloud_project.projects["json-rpc"]: Refreshing state... [id=sebastian-toepfer_json-rpc]
module.sebastian-toepfer.sonarcloud_project.projects["condition4j"]: Refreshing state... [id=sebastian-toepfer_condition4j]
module.sebastian-toepfer.sonarcloud_project.projects["json-schema"]: Refreshing state... [id=sebastian-toepfer_json-schema]
module.sebastian-toepfer.sonarcloud_project.projects["bnf4j"]: Refreshing state... [id=sebastian-toepfer_bnf4j]
module.sebastian-toepfer.sonarcloud_project.projects["openvdi"]: Refreshing state... [id=sebastian-toepfer_openvdi]
data.github_user.sebastian-toepfer: Reading...
module.sebastian-toepfer.github_repository.gh-common: Refreshing state... [id=gh-common]
module.sebastian-toepfer.github_repository.workspaces: Refreshing state... [id=workspaces]
module.sebastian-toepfer.github_repository.repos["condition4j"]: Refreshing state... [id=condition4j]
module.sebastian-toepfer.github_repository.my-github: Refreshing state... [id=my-github]
module.sebastian-toepfer.github_repository.repos["3d-models"]: Refreshing state... [id=3d-models]
module.sebastian-toepfer.github_repository.pdf-test: Refreshing state... [id=pdf-test]
module.sebastian-toepfer.github_repository.repos["learning-rust"]: Refreshing state... [id=learning-rust]
module.sebastian-toepfer.github_repository.repos["domain-driven-desgin"]: Refreshing state... [id=domain-driven-desgin]
module.sebastian-toepfer.github_repository.repos["json-schema"]: Refreshing state... [id=json-schema]
data.github_user.sebastian-toepfer: Read complete after 0s [id=61313468]
module.sebastian-toepfer.github_repository.repos["pdfbox-fluent-layout"]: Refreshing state... [id=pdfbox-fluent-layout]
module.sebastian-toepfer.github_repository.repos["virtual-gaming-station"]: Refreshing state... [id=virtual-gaming-station]
module.sebastian-toepfer.github_repository.repos["refaster"]: Refreshing state... [id=refaster]
module.sebastian-toepfer.github_repository.repos["json-printable-maven-plugin"]: Refreshing state... [id=json-printable-maven-plugin]
module.sebastian-toepfer.github_repository.repos["openvdi"]: Refreshing state... [id=openvdi]
module.sebastian-toepfer.github_repository.repos["oss-mvn-parent"]: Refreshing state... [id=oss-mvn-parent]
module.sebastian-toepfer.github_repository.repos["bnf4j"]: Refreshing state... [id=bnf4j]
module.sebastian-toepfer.github_repository.repos["json-rpc"]: Refreshing state... [id=json-rpc]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu planned the following actions, but then encountered a problem:

  # module.sebastian-toepfer.github_repository.workspaces will be created
  + resource "github_repository" "workspaces" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "workspaces"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @dependabot[bot], Action: `pull_request`, Working Directory: ``, Workflow: `plan`*